tap "bepisdev/homebrew", "git@github.com:bepisdev/homebrew.git"
tap "hashicorp/tap"
tap "nikitabobko/tap"
tap "romankurnovskii/awesome-brew"

brew "awk"
brew "glib"
brew "pixman"
brew "cmake"
brew "coreutils"
brew "cpanminus"
brew "node"
brew "devcontainer"
brew "dos2unix"
brew "fd"
brew "sdl2"
brew "ffmpeg"
brew "fzf"
brew "git"
brew "git-extras"
brew "git-flow-avh"
brew "go"
brew "imagemagick"
brew "ispell"
brew "lazygit"
brew "libgcrypt"
brew "libpq"
brew "libslirp"
brew "llvm"
brew "lua"
brew "pinentry-mac"
brew "python@3.13"
brew "tcl-tk"
brew "python-tk@3.13"
brew "python-tk@3.14"
brew "qemu"
brew "ruby-build"
brew "rbenv"
brew "ripgrep"
brew "rustup"
brew "sshpass"
brew "step"
brew "stow"
brew "tree"
brew "tree-sitter"
brew "tree-sitter-cli"
brew "uv"
brew "yamlfix"
brew "ykman"
brew "yt-dlp"
brew "zplug"
brew "zsh"
brew "bepisdev/homebrew/sshmux"

cask "bitwarden"
cask "docker-desktop"
cask "font-iosevka-term-nerd-font"
cask "google-chrome"
cask "handbrake-app"
cask "mongodb-compass"
cask "powershell"
cask "raspberry-pi-imager"
cask "spotify"
cask "tabby"
cask "tailscale-app"
cask "transmission"
cask "visual-studio-code"
cask "vlc"
cask "yubico-yubikey-manager"

vscode "chouzz.vscode-better-align"
vscode "eamodio.gitlens"
vscode "espressif.esp-idf-extension"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "humao.rest-client"
vscode "idleberg.icon-fonts"
vscode "ms-azuretools.vscode-containers"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.powershell"
vscode "nwallace.createguid"
vscode "orepor.color-tabs-vscode-ext"
vscode "platformio.platformio-ide"
vscode "qinjia.seti-icons"
vscode "uloco.theme-bluloco-dark"
vscode "vscodevim.vim"

go "golang.org/x/tools/gopls"
