tap "bepisdev/homebrew", "git@github.com:bepisdev/homebrew.git"
tap "nikitabobko/tap"
tap "romankurnovskii/awesome-brew"

brew "awk"
brew "node"
brew "bash-language-server"
brew "cmake"
brew "coreutils"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "git"
brew "git-extras"
brew "git-flow-avh"
brew "go"
brew "python@3.13"
brew "neovim"
brew "pinentry-mac"
brew "qemu"
brew "ripgrep"
brew "rustup"
brew "stow"
brew "tree"
brew "uv"
brew "ykman"
brew "yt-dlp"
brew "zplug"
brew "zsh"
brew "bepisdev/homebrew/sshmux"

cask "aerospace"
cask "bitwarden"
cask "docker-desktop"
cask "font-fira-mono-nerd-font"
cask "font-iosevka-term-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "gpg-suite-no-mail"
cask "mysqlworkbench"
cask "raspberry-pi-imager"
cask "spotify"
cask "tigervnc-viewer"
cask "transmission"
cask "vlc"
cask "yubico-yubikey-manager"
